#pragma once
#include "BlockGroup.h"

class BlockGroupI : public BlockGroup
{
public:
	BlockGroupI(void);
	virtual ~BlockGroupI(void);

	//公共接口
public:
	/************************************************************************/
	/* 初始化图形                                                           */
	/************************************************************************/
	virtual bool Init();

	/************************************************************************/
	/* 旋转图形                                                             */
	/************************************************************************/
	virtual bool Rotate(const vector<BlockObject>& blocks);

	/************************************************************************/
	/* 加速下落图形                                                         */
	/************************************************************************/
	virtual void SpeedUp();

	virtual void initBlockGroupInDropMode(int colorIndex);
protected:
	/************************************************************************/
	/* 设置图形类型                                                         */
	/************************************************************************/
	virtual void SetBlockGroupType();
};

